testing/artillery/test-edit.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 5
      arrivalRate: 5
      rampTo: 10
      name: Warm up phase
    - duration: 5
      arrivalRate: 5
      rampTo: 20
      name: Ramp up
    - duration: 5
      arrivalRate: 5
      rampTo: 50
      name: Spike phase

  processor: "./processor.js"

scenarios:
  - name: "Prueba de carga: EditUser"
    flow:
      - function: "generateCredentials"
      - post:
          url: "/adduser"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
      - think: 5
      - post:
          url: "/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
      - think: 5
      - post:
          url: '/editUser'
          json:
            username: "{{ username }}"
            currentPassword: "{{ password }}"
            newPassword: "{{ password }}A"