testing/artillery/test-login.yml
config:
  target: "http://18.171.52.37:8000"
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 250
      name: Warm up phase
    - duration: 10
      arrivalRate: 250
      rampTo: 500
      name: Ramp up load
    - duration: 15
      arrivalRate: 500
      rampTo: 1000
      name: Spike phase
  
  processor: "./processor.js"

scenarios:
  - name: "Prueba de carga: Login"
    flow:
      - function: "generateCredentials"
      - post:
          url: "/adduser"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
      - think: 5
      - post:
          url: "/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"